#pragma once

#ifndef __Cru_DEFiNE_H
#define __Cru_DEFiNE_H
// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■.
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■.
// ◈ 정의상수

#define SAFE_DELETE_ARRAY(p) { if(p) { delete[] (p); (p)=NULL; } }
#define SAFE_DELETE(p)       { if(p) { delete (p);   (p)=NULL; } }

#define     MAX_FLAG                (1000+1)     // 최대 플랙 개수             .
#define     MAX_STAT                (1000+1)     // 최대 상태 개수             .

#define     MAX_USERs               1024         // 서버당 최대 가용유저수     .
#define     MAX_TABLE_USERs         7            // 한 테이블의 최대 유저수    .

// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■.
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■.
// ◈ 정의타입
typedef __int64    BINT;

// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■.
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■.
// ◈ 시스템플랙 - 상수리스트
enum _FLAG_List
{
    flag_NONE = 000,                   //                                      .
                                       //                                      .
    f_LGN_START,                       // 플랙 : LGN 프로그램 개시             .
    f_PGM_START,                       // 플랙 : PGM 프로그램 개시             .
                                       //                                      .
    f_NET,                             // 플랙 : 네트워크 설정                 .
                                       //                                      .
    f_HELP,                            // 플랙 : 도움말정보                    .
                                       //                                      .
    f_DEBUG,                           // 플랙 : 디버깅정보                    .
    f_DEBUG_PGM,                       // 플랙 : 디버깅 PGM 정보               .
    f_DEBUG_DTA,                       // 플랙 : 디버깅 DTA 정보               .
    f_DEBUG_nTX,                       // 플랙 : 디버깅 네트워크 텍스트 정보   .
                                       //                                      .
    f_Ui_HanDiSP,                      // 플랙 : Ui 한글이름                   .
    f_Ui_HDLE,                         // 플랙 : Ui 핸들번호                   .
    f_Ui_Name,                         // 플랙 : Ui 이름                       .
    f_Ui_BOX,                          // 플랙 : Ui 경계크기                   .
    f_Ui_RealBND,                      // 플랙 : Ui 실제 경계크기              .
    f_Ui_ANi,                          // 플랙 : Ui 애니메이션 번호            .
    f_Ui_RTE,                          // 플랙 : Ui 이동경로 정보              .
    f_Ui_GRP,                          // 플랙 : Ui 그룹                       .
    f_Ui_LYR,                          // 플랙 : Ui 레이어번호                 .
    f_Ui_SCALE,                        // 플랙 : Ui 스케일                     .
    f_Ui_csnDiSP,                      // 플랙 : Ui 충돌정보                   .
    f_PLAY,                            // 플랙 : 플레이 상태                   .
    f_QUiT,                            // 플랙 : 실행종료 처리신호             .
    f_FULLSCR,                         // 플랙 : 풀스크린 상태                 .
    f_FPS,                             // 플랙 : FPS 표시                      .
                                       //                                      .
    f_SCN,                             // 플랙 : 화면 in 마우스업 상태         .
                                       //                                      .
    f_CMD,                             // 플랙 : 커맨드라인 활성화             .
    f_SFX,                             // 플랙 : 특수효과   활성화             .
                                       //                                      .
    f_Ui_CONTROL,                      // 플랙 : Ui 컨트롤 배치가능            .
                                       //                                      .
    f_Ui_wMOVE,                        // 플랙 : Ui 미세조정                   .
                                       //                                      .
    f_Ui_SNAP,                         // 플랙 : Ui 자석효과                   .
                                       //                                      .
};
// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■.
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■.
#endif
